software/monad-challenges/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-12 dom 11:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Monad Challenges</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Stefano Rodighiero" />
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href="http://stefanorodighiero.net/css/notes2.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="http://stefanorodighiero.net/wiki/"> UP </a>
 |
 <a accesskey="H" href="http://stefanorodighiero.net/"> HOME </a>
</div><div id="content">
<h1 class="title">Monad Challenges</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Set one - Random numbers</a></li>
<li><a href="#orgheadline2">Set two - Failing computations</a></li>
<li><a href="#orgheadline3">Set three - Combinations</a></li>
<li><a href="#orgheadline4">Set four - Common Abstraction</a></li>
<li><a href="#orgheadline5">Set five - Do notation</a></li>
</ul>
</div>
</div>
<p>
Here are my solutions, together with some notes and commentary. Some
times I got stuck and I had to ask more expert Haskell users: their
help was not only useful to solve the problem at hand, but it gave me
a deeper understanding of what was going on, or a different point of
view on the subject or a different solution. I hope I'm able to
faithfully render their invaluable insight.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><a href="set1.html">Set one</a> - Random numbers</h2>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><a href="set2.html">Set two</a> - Failing computations</h2>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Set three - Combinations</h2>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">Set four - Common Abstraction</h2>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Set five - Do notation</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-02-13 sab&gt;</span></span></p>
<p class="author">Author: Stefano Rodighiero</p>
<p class="date">Created: 2016-06-12 dom 11:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
